HamidHekmatnezhad/Kuruma_Uni_Project_Mikrocontroller/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM1CH0SRC_FTM 0x00u /*!<@brief FTM1 channel 0 input capture source select: FTM1_CH0 signal */

/*! @name PORTA2 (coord K6), J9[6]/JTAG_TDO/TRACE_SWO/EZP_DO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_TRACE_SWO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_TRACE_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_TRACE_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTC6 (coord C8), J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2S_MCLK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2S_MCLK_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_I2S_MCLK_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE11 (coord G4), J1[3]/J38[3]/I2S_TX_WCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_SERVO0_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_SERVO0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_SERVO0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTE12 (coord G3), J1[1]/J37[3]/I2S_TX_BCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_SER1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_SER1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_SER1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC1 (coord B11), J1[5]/U20[C5]/I2S_TXD
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_DIR_A_FTM0_CH0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_DIR_A_FTM0_CH0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_DIR_A_FTM0_CH0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC2 (coord A12), J1[14]/FTM0_CH1/CMP1_IN0/FB_AD12
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_DIR_B_FTM0_CH1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_DIR_B_FTM0_CH1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_DIR_B_FTM0_CH1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC3 (coord A11), J1[2]/UART1_RX/FTM0_CH2/CLKOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_DIR_C_FTM0_CH2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_DIR_C_FTM0_CH2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_DIR_C_FTM0_CH2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA6 (coord J7), J3[7]/CLKOUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_MOTOR_EN_A_PTA6_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_MOTOR_EN_A_PTA6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_EN_A_PTA6_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_EN_A_PTA6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_EN_A_PTA6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA7 (coord J8), J3[9]/FTM0_CH4/TRACE_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_MOTOR_EN_B_PTA7_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_MOTOR_EN_B_PTA7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_EN_B_PTA7_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_EN_B_PTA7_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_EN_B_PTA7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA1 (coord J6), J3[15]/FTM0_CH6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_MOTOR_EN_C_PTA1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_MOTOR_EN_C_PTA1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_EN_C_PTA1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_EN_C_PTA1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_EN_C_PTA1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC0 (coord B12), J2[11]/ADC0_SE14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_BEMF1_A_ADC0_SE14_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_BEMF1_A_ADC0_SE14_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_BEMF1_A_ADC0_SE14_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTE24 (coord M4), J2[13]/ADC0_SE17
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_BEMF1_B_ADC0_SE17_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_BEMF1_B_ADC0_SE17_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_BEMF1_B_ADC0_SE17_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                                /* @} */

