HamidHekmatnezhad/Kuruma_Uni_Project_Mikrocontroller/board/pin_mux.h
/*! @name PORTE25 (coord K5), J2[15]/ADC0_SE18
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_BEMF1_C_ADC0_SE18_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_BEMF1_C_ADC0_SE18_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_BEMF1_C_ADC0_SE18_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTB2 (coord G12), J4[12]/ADC0_SE12/I2C0_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_BEMF10_A_ADC0_SE12_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_BEMF10_A_ADC0_SE12_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_BEMF10_A_ADC0_SE12_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTB3 (coord G11), J4[10]/ADC0_SE13/I2C0_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_MOTOR_BEMF10_B_ADC0_SE13_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_MOTOR_BEMF10_B_ADC0_SE13_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_MOTOR_BEMF10_B_ADC0_SE13_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name ADC0_SE23 (coord L3), J4[11]/DAC_OUT
  @{ */
/* @} */

/*! @name ADC0_DM0 (coord L2), J2[3]/ADC0_DM0_RC
  @{ */
/* @} */

/*! @name PORTA8 (coord K8), J3[11]/FTM1_CH0/TRACE_D2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CAMERA1_FTM1_CH0_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_CAMERA1_FTM1_CH0_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_CAMERA1_FTM1_CH0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB4 (coord G10), J4[8]/ADC1_SE10
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CAMERA_ADC1_SE10_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_CAMERA_ADC1_SE10_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_CAMERA_ADC1_SE10_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA9 (coord L8), J3[13]/FTM1_CH1/TRACE_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_PARALLAX1_SI_PTA9_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_PARALLAX1_SI_PTA9_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_PARALLAX1_SI_PTA9_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_PARALLAX1_SI_PTA9_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_PARALLAX1_SI_PTA9_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD2 (coord C4), J2[8]/SPI0_SOUT/FB_AD4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2C0_SOUT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2C0_SOUT_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_I2C0_SOUT_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTD3 (coord B4), J2[10]/SPI0_SIN/FB_AD3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_I2c0_SIN_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_I2c0_SIN_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_I2c0_SIN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD13 (coord C3), J2[17]/FB_A21
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BTN_START_MOTOR_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_BTN_START_MOTOR_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BTN_START_MOTOR_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_BTN_START_MOTOR_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_BTN_START_MOTOR_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC10 (coord C7), J2[20]/U20[D8]/I2C1_SCL/DA7212_CLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BTN_CHANGE_COLOR_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_BTN_CHANGE_COLOR_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BTN_CHANGE_COLOR_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_BTN_CHANGE_COLOR_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_BTN_CHANGE_COLOR_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD12 (coord B1), J2[19]/FB_A20
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BTN_CHANGE_PWM_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_BTN_CHANGE_PWM_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BTN_CHANGE_PWM_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_BTN_CHANGE_PWM_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_BTN_CHANGE_PWM_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name ADC1_DM0 (coord M2), J4[3]/DIFF_ADC1_DM0
  @{ */
/* @} */

/*! @name ADC1_DP0 (coord M1), J4[1]/DIFF_ADC1_DP0
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

